const AllService = () => {
  return(
    <div>
    <h3>利用規約</h3><hr/>
    <h4>２０２１年２月２３日更新</h4>
    本利用規約（「以下、本規約」）は、https://www.keeykeey.comにあるウェブサイト「以下、当サイト」）の利用に関して、遵守事項を記載したものです。本規約に記載する例は例示であって、すべてを網羅するものではありません。当サイト運営者（以下、当運営者）は、当サイトに改訂版を掲示する等によって、随時、本規約を変更する可能性があります。当サイトへアクセスするサービス利用者は、本規約の最新版に合意したものとみなされます。サービス利用者が本規約に違反した場合、または他人が違反することを許可もしくは助長した場合には、当運営者は、サービス利用者による本サービスの利用を停止または中止する可能性があります。

    <h4>違法、有害、不快な使用またはコンテンツの禁止</h4>
    <ul>
    サービス利用者は、違法な、有害な、詐欺的な、第三者の権利を侵害する、もしくは不快な使用のために、または違法な、有害な、詐欺的な、第三者の権利を侵害する、もしくは不快なコンテンツの配信等のために、当サイトを使用してはならず、かつ、他人がかかる使用をすることを奨励、促進、助長、もしくは指示してはならないものとします。禁止される行為またはコンテンツには、以下が含まれます:<br/>
    <ul>
    <li>違法、有害または詐欺的な行為。児童ポルノの流布、宣伝、もしくは助長、詐欺的な製品、サービス、仕組み、もしくはプロモーションの売り込みや流布、一攫千金スキーム、ねずみ講、マルチ商法、フィッシング、またはファーミングを含む違法な、第三者の権利を侵害する、または第三者、当運営者の事業、もしくは当運営者の評判に有害となり得る行為。</li><br/>
    <li>第三者の権利を侵害するコンテンツ。知的財産権またはその他の所有権を侵害または濫用するコンテンツ。</li><br/>
    <li>不快なコンテンツ。児童ポルノを含む、獣姦に関連する、または非合意性行為を描くコンテンツを含む、中傷的、わいせつ、虐待的、プライバシーを侵害する、もしくは不愉快なコンテンツ。</li><br/>
    <li>有害なコンテンツ。ウイルス、トロイの木馬、ワーム、時限爆弾、またはキャンセルボットを含む、システム、プログラム、またはデータを損傷する、妨害する、不正に傍受する、あるいは不正使用するコンテンツまたはその他のコンピュータ技術。</li>
    </ul>
    </ul>

    <h4>セキュリティ違反の禁止</h4>
    <ul>
    サービス利用者は、ネットワーク、コンピュータ、通信システム、ソフトウェアアプリケーション、ネットワークデバイス、またはコンピューティングデバイス（それぞれを「本件システム」という）のセキュリティや整合性を侵害するような方法で本サービスを使用しないものとします。禁止される行為には、以下が含まれます:<br/>
    <ul>
    <li>不正アクセス。本件システム脆弱性の調査、スキャン、またはテスト、あるいは本件システムで使用される任意のセキュリティまたは認証方法への侵害を含め、許可なく本件システムへアクセスする、または本件システムを使用すること。</li><br/>
    <li>傍受。許可なしに、本件システムのデータまたはトラフィックを監視すること。</li><br/>
    <li>オリジンの改ざん。TCP-IP パケットヘッダー、またはそのオリジンやルートを記載したメッセージの任意の部分を改ざんすること。</li>
    </ul>
    </ul>

    <h4>ネットワーク不正使用の禁止</h4>
    <ul>サービス利用者は、いかなるユーザー、ホスト、またはネットワークに対しても、それらと通信するための許可を得ていない限り、ネットワーク接続をしないものとします。 禁止される行為には、以下が含まれます:<br/>
    <ul>
    <li>モニタリングまたはクローリング。モニタリングまたはクローリングの対象とされる本件システムの機能を妨害または破壊するような、本件システムのモニタリングまたはクローリング。</li>
    <li>サービス妨害（DoS）。ターゲットが正当なトラフィックに応答することができなくなる、あるいはスピードが異常に落ちて実効性が失われるように、ターゲットに大量の通信リクエストを発信すること。</li>
    <li>意図的妨害。メール爆弾、ニュース爆撃、ブロードキャスト攻撃、またはフラッディング技術によって意図的にシステム過負荷を生じさせる試みを含め、本件システムの適正な機能を妨害すること。</li>
    <li>一定のネットワークサービスの運用。公開プロキシ、オープンメールリレー、オープン再帰ドメインネームサーバーなどのネットワークサービスを運用すること。</li>
    <li>システムの制限の回避。アクセス制限およびストレージ制限などの本件システムに設定された使用制限を回避する、手動または電子的手段を使用すること。</li>
    </ul>
    </ul>

    <h4>Ｅメールまたはその他のメッセージの不正利用の禁止</h4>
    <ul>サービス利用者は、商業的宣伝および情報発表、プロモーション、宣伝、または勧誘（「スパム」等）を配信、公開、送信、または助長しないものとします。</ul>

    <h4>当運営者のモニタリングと強制措置</h4>
    <ul>
    当運営者は、本規約の違反、あるいは本サービスまたは 当サイトの悪用を調査する権利を留保しますが、かかる義務を負うものではありません。当運営者は以下を実行する可能性があります:<br/>
    <ul>
    <li>本規約の違反、あるいは本サービスまたは当サイトの悪用を調査する。</li>
    <li>本規約、あるいは本サービスまたは当サイトの利用に関する当運営者とサービス利用者の間のその他の合意に違反するコンテンツやリソースを削除する、それらへのアクセスを無効にする、または変更する。</li>
    </ul>
    当運営者は、法令または規制に違反する疑いがある一切の行為を、適切な法執行機関、規制当局、またはその他の適切な第三者に報告する可能性があります。当運営者による報告には、該当するカスタマー情報の開示が含まれる可能性があります。当運営者はまた、申し立てられた本規約の違反に関係するネットワークおよびシステム情報を提供して、適切な法執行機関、規制当局、またはその他の適切な第三者と協同することで、違法行為の捜査および起訴に協力する可能性があります。
    </ul>

    <h4>本規約の違反の報告</h4>
    <ul>サービス利用者が本規約の違反に気付いた場合は、直ちに当運営者に通知し、違反を阻止または是正するため、要求に応じて、支援を提供するものとします。</ul>
    </div>
  )
}

const Terms = {
  AllService,
};

export default Terms
